[M_IrisDL2_DontTalkAbtMama MissionDefinition]
MissionName="People who disrespect the mother"
MissionDescription="A biker named Ham Hawk tries to hug Moxie. pedestrian's mom on the chest. You are ordered to find and kill Hawk.."
TurnInDescription="Unfortunately, what became known as the "Hamhawk Scandal" was solved successfully.''."
MissionSummary="Find a hammer and give it a chance.."
MissionGiver="Scooter"
MissionTurnInLocation="Scooter or Moxie"
TeaserText="Don't mess with Scooter's mom.!"

[M_IrisDL2_DontTalkAbtMama:FakeKillHamhock MissionObjectiveDefinition]
ProgressMessage="Please kill this falcon."

[M_IrisDL2_DontTalkAbtMama:KillHamhock MissionObjectiveDefinition]
ProgressMessage="Defeat Scooter Ham Hawk"

[M_IrisDL2_DontTalkAbtMama:KillScooterMen MissionObjectiveDefinition]
ProgressMessage="kill the snake for Moxie"

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetBranchingDefinition_0 MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride="Hit the pig chopper or scooter fender."
MissionDescriptionOverride="A biker named Hamhawk tries to kill Scooter's mother, Moxie, by punching her in the chest. He ordered that Amhak be found and killed..<br><br>But when you see a swing, moxie calls to you. After declaring that his relationship with Amhawk is cordial, he offers his cure. Save Amhok's life and kill the other assassins sent by Scooter and he will reward you..<br><br>Instead, Scooter says that Mahak is a pig to be killed and he will reward him if he dies..<br><br>Whatever your decision."

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL2_DontTalkAbtMama:ReachBeatdown MissionObjectiveDefinition]
ProgressMessage="Look for Hammock"

